{
  "@context": "https://www.w3.org/ns/activitystreams",
  "attributedTo": "https://www.lqdev.me/@lqdev",
  "content": "<![CDATA[[reshare] <blockquote class=\"blockquote\">\n<p>Social media was built on the romance of authenticity. Early platforms sold themselves as conduits for genuine connection: stuff you wanted to see, like your friendâ\u0080\u0099s wedding and your cousinâ\u0080\u0099s dog.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>The feed no longer feels crowded with people but crowded with content. At this point, it has far less to do with people than with consumers and consumption.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Whatever remains of genuine, human content is increasingly sidelined by algorithmic prioritization, receiving fewer interactions than the engineered content and AI slop optimized solely for clicks.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>While content proliferates, engagement is evaporating...People arenâ\u0080\u0099t connecting or conversing on social media like they used to; theyâ\u0080\u0099re just wading through slop, that is, low-effort, low-quality content produced at scale, often with AI, for engagement.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Engagement is now about raw user attention â\u0080\u0093 time spent, impressions, scroll velocity â\u0080\u0093 and the net effect is an online world in which you are constantly being addressed but never truly spoken to.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Social mediaâ\u0080\u0099s death rattle will not be a bang but a shrug.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>These networks once promised a single interface for the whole of online life...But now, the model is splintering, and users are drifting toward smaller, slower, more private spaces, like group chats, Discord servers and <a href=\"https://www.theverge.com/24063290/fediverse-explained-activitypub-social-media-open-protocol\">federated microblogs</a> â\u0080\u0094 a billion little gardens.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Intentional, opt-in microâ\u0080\u0091communities are rising in their place â\u0080\u0094 like Patreon collectives and Substack newsletters â\u0080\u0094 where creators chase depth over scale, retention over virality. A writer with 10,000 devoted subscribers can potentially earn more and burn out less than one with a million passive followers on Instagram.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>These are the last days of social media, not because we lack content, but because the attention economy has neared its outer limit â\u0080\u0094 we have exhausted the capacity to care.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Our offline reality is irrevocably shaped by our online world. Consider the worker who deletes or was never on LinkedIn, excluding themselves from professional networks that increasingly exist nowhere else</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>These platforms havenâ\u0080\u0099t just captured attention, theyâ\u0080\u0099ve enclosed the commons where social, economic and cultural capital are exchanged. But enclosure breeds resistance, and as exhaustion sets in, alternatives begin to emerge.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>...as social media collapses on itself, the future points to a quieter, more fractured, more human web, something that no longer promises to be everything, everywhere, for everyone.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>We can dream of a digital future where belonging is no longer measured by follower counts or engagement rates, but rather by the development of trust and the quality of conversation...None of this is about escaping the social internet, but about reclaiming its scale, pace, and purpose.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>The technical architecture of the next social web is already emerging through federated and distributed protocols like ActivityPub...But protocols alone wonâ\u0080\u0099t save us. The email protocol is decentralized, yet most email flows through a handful of corporate providers. We need to â\u0080\u009Crewild the internet,â\u0080\u009D as Maria Farrell and Robin Berjon mentioned in a Noema essay.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>Social media as we know it is dying, but weâ\u0080\u0099re not condemned to its ruins. We are capable of building better â\u0080\u0094 smaller, slower, more intentional, more accountable â\u0080\u0094 spaces for digital interaction, spaces where the metrics that matter arenâ\u0080\u0099t engagement and growth but understanding and connection, where algorithms serve the community rather than strip-mining it.</p>\n</blockquote>\n<blockquote class=\"blockquote\">\n<p>The last days of social media might be the first days of something more human: a web that remembers why we came online in the first place â\u0080\u0094 not to be harvested but to be heard, not to go viral but to find our people, not to scroll but to connect. We built these systems, and we can certainly build better ones. The question is whether we will do this or whether we will continue to drown.</p>\n</blockquote>\n]]>",
  "id": "https://www.lqdev.me/activitypub/notes/015",
  "name": "The Last Days of Social Media",
  "published": "2025-09-12T20:19:00Z",
  "tag": [],
  "type": "Note",
  "url": "https://www.lqdev.me/responses/last-days-social-media-noemag"
}